{
    "companies": [
        {
            "title": "Wix",
            "logo": "wix.svg",
            "years": "August 2023 - current",
            "url": "https://wix.com",
            "projects": []
        },
        {
            "title": "Coherent Solutions",
            "logo": "coherent-solutions.svg",
            "years": "November 2021 - August 2023",
            "url": "https://coherentsolutions.com",
            "projects": [
                {
                    "title": "Self service portal",
                    "client": {
                        "url": "https://www.warbyparker.com/",
                        "title": "Warby Parker"
                    },
                    "description": "As a Frontend Developer at Warby Parker, I played a pivotal role in the conceptualization, design, and implementation of a cutting-edge self-service portal. Leveraging my expertise in frontend technologies, I developed a user-friendly interface that empowered clients to perform essential tasks, such as measuring pupillary distance and seamlessly ordering new lenses.",
                    "tools": "React, React-Query, TypeScript"
                },
                {
                    "title": "Communications",
                    "client": {
                        "url": "https://www.achieveloans.com/",
                        "title": "Achieve Loans"
                    },
                    "description": "Developed an internal UI for client communication, encompassing SMS/email history, integration with Firebase and external APIs. Implemented features allowing mortgage advisors to send emails or SMS, maintain conversations, and view a comprehensive history within the internal user management system.",
                    "tools": "React, React-Query, TypeScript, EmotionJS, MUI"
                },
                {
                    "title": "Custom Chat",
                    "client": {
                        "url": "https://www.achieveloans.com/",
                        "title": "Achieve Loans"
                    },
                    "description": "Designed and implemented a custom chat system for both internal and external clients. Managed stateless web sockets API from LiveChat for controlling notifications, chat history, and handling unresponsive chats by transferring them to available agents.",
                    "tools": "TypeScript, React, Redux, Web Sockets, LiveChat API, Jest"
                },
                {
                    "title": "Monorepo",
                    "client": {
                        "url": "https://www.achieveloans.com/",
                        "title": "Achieve Loans"
                    },
                    "description": "Established a solution for managing reusable packages for frontend applications. Organized workflows for building, deploying, and publishing using Lerna, and migrated all packages from different repositories while preserving commit history. Implemented conventional commits for accurate package versioning.",
                    "tools": "Lerna, Rollup, Shell, GitHub Actions"
                }
            ]
        },
        {
            "title": "1stDibs",
            "logo": "1stdibs.png",
            "years": "March 2017 - June 2021",
            "url": "https://1stdibs.com",
            "projects": [
                {
                    "title": "Growth (SEO)",
                    "description": "Implemented various internal and external strategies to enhance search engine ranking, reduce bounce rates, and optimize user experience with automatically generated content.",
                    "achievements": [
                        "Executed diverse strategies for increasing traffic",
                        "Developed internal tools for configuring and improving SEO",
                        "Migrated Q&A project from WordPress to a React, Relay, and GraphQL stack"
                    ],
                    "tools": "React, GraphQL, Relay, Redux, TypeScript, Express.js, Fastify"
                },
                {
                    "title": "User Onboarding / Personalized Experience",
                    "description": "Led a project aimed at generating more users and gathering information for creating a personalized experience in terms of product prices, verticals, etc.",
                    "achievements": [
                        "Introduced an email-only registration flow",
                        "Implemented an interactive questionnaire for personalizing user experience based on responses",
                        "Enhanced the UX of onboarding for new users"
                    ],
                    "tools": "React, GraphQL, Relay, Redux, TypeScript, Express.js, Fastify"
                },
                {
                    "title": "Internationalization and Localization",
                    "description": "Internationalized and localized buyer-side web applications. Developed an automated pipeline for translations, supporting new domains (fr, co.uk, de).",
                    "achievements": [
                        "Localized the buyer side of the 1stDibs platform",
                        "Implemented an automated pipeline for translating American English to different languages such as German, French, and British English",
                        "Migrated and ensured correct locale by domain"
                    ],
                    "tools": "React-Intl, React, GraphQL, Relay, Express.js, Nginx"
                },
                {
                    "title": "Search & Browse, Product Page Refactoring",
                    "description": "Rewrote search and browse, product pages with React, Relay, and GraphQL. Migrated code from PHP to a new technological stack, optimizing UI for the best mobile experience and creating a mobile-first application version.",
                    "achievements": [
                        "Rewrote search and browse pages from PHP to React, Relay, and GraphQL",
                        "Optimized UI for the best mobile experience",
                        "Created a mobile-first application version",
                        "Migrated all parts to the new codebase and updated UI"
                    ],
                    "tools": "React, Relay, TypeScript, GraphQL, Lodash, Express.js"
                }
            ]
        },
        {
            "title": "Adform",
            "logo": "adform_logo.svg",
            "years": "November 2013 - January 2017",
            "url": "https://adform.com",
            "projects": [
                {
                    "title": "Styleguide Driven Development",
                    "description": "Implemented style guides for the UI library, maintaining UX consistency across 18 projects built by different teams. Trained developers on the use and implementation of the UI library.",
                    "achievements": [
                        "Documented and created different UI modules for usage in other projects",
                        "Continuously updated and maintained consistent UI/UX experience across the platform",
                        "Conducted presentations and training for other developers on using and implementing our UI library within organizational projects"
                    ],
                    "tools": "Web Components, Node.js, jQuery, Backbone.js, JavaScript"
                },
                {
                    "title": "UI Library for Internal Products",
                    "description": "Maintained and improved the internal UI library used for numerous internal projects. Created and updated UI components, assisted other teams in implementing those components, and provided support and bug fixes.",
                    "achievements": [
                        "Created and maintained different UI elements (datepicker, grid, multi-select) for our UI library",
                        "Documented and assisted other teams in implementing those UI elements in their projects",
                        "Provided support and bug fixes for components"
                    ],
                    "tools": "HTML5, Vanilla JavaScript, jQuery, Backbone.js, Lodash, Styleguide Driven Development"
                },
                {
                    "title": "HTML5 Interactive Banners",
                    "description": "Created interactive HTML5 ads for EU/UK publishers, focusing on responsive, mobile-first ads. Collaborated with clients on design and animations prototyping for their ads.",
                    "achievements": [
                        "Created interactive ads for various EU/UK publishers such as Aftonbladet, Sky, etc.",
                        "Collaborated with clients on design and animations prototyping for their ads",
                        "Improved ads by reducing the weight of assets (video, images) while maintaining quality and adding statistics to track possible future improvements"
                    ],
                    "tools": "HTML5, Vanilla JavaScript, Canvas, CSS"
                }
            ]
        }
    ]
}
