{
    "companies": [
        {
            "title": "Coherent Solutions",
            "logo": "coherent-solutions.svg",
            "years": "2021-11 - current",
            "projects": [
                {
                    "title": "Communications",
                    "client": {
                        "url": "https://www.achieveloans.com/",
                        "title": "AchieveLoans"
                    },
                    "description": "Internal UI for communication with clients - sms/email history, integration with firebase and external APIs. Ability to send email or sms, keep the conversation and see all history within the internal user management system for mortgage advisors.",
                    "tools": "react, react-query, typescript, emotionJS, MUI"
                },
                {
                    "title": "Custom chat",
                    "client": {
                        "url": "https://www.achieveloans.com/",
                        "title": "AchieveLoans"
                    },
                    "description": "Created custom chat both for internal and external clients could use. Manage stateless web sockets API from LiveChat for controlling notifications, chat history, and handling unresponsive chats by transferring them to free agents.",
                    "tools": "typescript, react, redux, web sockets, LiveChat API, jest"
                },
                {
                    "title": "Monorepo",
                    "client": {
                        "url": "https://www.achieveloans.com/",
                        "title": "AchieveLoans"
                    },
                    "description": "Created a solution for managing reusable packages for frontend applications. Organized workflow for building, deploying, and publishing with lerna and migrate all packages from different repositories maintaining all commits history. Used conventional commits for correct package versioning.",
                    "tools": "Lerna, rollup, shell, GitHub actions"
                }
            ]
        },
        {
            "title": "1stDibs",
            "logo": "1stdibs.png",
            "years": "2017-03 - 2021-06",
            "projects": [
                {
                    "title": "Growth (SEO)",
                    "description": "Use different internal/external strategies to increase search engine ranking, lower bounce rate, fulfill user experience with automatically generated content.",
                    "achievements": [
                        "Implement different strategies for increasing traffic",
                        "Created internal tools for configuring and improving SEO",
                        "Migrated Q&A project from WordPress to react, relay, and graphQL stack"
                    ],
                    "tools": "react, graphQL, relay, redux, typescript, express.js, fastify"
                },
                {
                    "title": "User onboarding / personalized experience",
                    "description": "The goal of the project was to generate more users and get information from them so we could make a more personalized experience in terms of product prices, verticals, etc.",
                    "achievements": [
                        "Email-only registration flow",
                        "Interactive questionnaire for personalizing user experience based on responses",
                        "Improve UX of onboarding new users"
                    ],
                    "tools": "react, graphQL, relay, redux, typescript, express.js, fastify"
                },
                {
                    "title": "Internationalization and localization",
                    "description": "The goal of the project was to internationalize and localize buyer-side web applications. We have created an automated pipeline for translations, supporting a few new domains (fr, co.uk, de).",
                    "achievements": [
                        "Localize buyer side of 1stDibs platform",
                        "Created automated pipeline for translating American English to different languages such as German, French, and British English.",
                        "Migrate and provide correct locale by domain"
                    ],
                    "tools": "react-intl, react, graphql, relay, express.js, Nginx"
                },
                {
                    "title": "Search&Browse, product page refactoring",
                    "description": "Rewrite search and browse, product pages with react, relay, and graphQL. Migrate code from PHP to a new technological stack. Maintain all major parts, also improve load time and create maintainable and easily expandable codebase for JS/Frontend developers.",
                    "achievements": [
                        "Rewrite search and browse pages from PHP to react, relay and graphQL",
                        "Optimize UI for the best mobile experience",
                        "Create a mobile-first application version",
                        "Migrate all parts to the new codebase and update UI"
                    ],
                    "tools": "react, relay, typescript, graphQL, lodash, express.js"
                }
            ]
        },
        {
            "title": "Adform",
            "logo": "adform_logo.svg",
            "years": "2013-11 - 2017-01",
            "projects": [
                {
                    "title": "Styleguide driven development",
                    "description": "The main goal of the project was to implement style guides for our UI library. We had around 18 projects built by different teams within an organization. Hence, our goal was to maintain UX between those products since they were operating under one domain, making other developers implementing the UI part simpler and shortening overall product development time.",
                    "achievements": [
                        "Document and create different UI modules for usage in other projects",
                        "Continuously update and maintain consistent UI/UX experience across the platform",
                        "Present and train to other developers on how to use and implement our UI library within organization projects"
                    ],
                    "tools": "web components, nodejs, jQuery, backbone.js, javascript"
                },
                {
                    "title": "UI libarary for internal products",
                    "description": "Maintain and constantly improve internal UI library which was used to build numerous internal projects by developers outside and within organization. My main responsibilities were to create/update UI components, maintain already created ones, and help implement those in projects.",
                    "achievements": [
                        "Create and maintain different UI elements (datepicker, grid, multi-select) for our UI library",
                        "Document and help other teams in implementing those UI elements in their projects",
                        "Support and bug fix components"
                    ],
                    "tools": "HTML5, Vanilla JavaScript, JQuery, backbone.js, lodash, styleguide driven development"
                },
                {
                    "title": "HTML5 interactive banners",
                    "description": "Creating interactive HTML5 ads for EU/UK publishers. Creating responsive, mobile-first ads. This project included a lot of communication with clients – determining client goals, approving designs, etc.",
                    "achievements": [
                        "Created interactive ads for various EU/UK publishers such as Aftonbladet, Sky, etc.",
                        "Collaborated with clients on design and animations prototyping for their ads",
                        "Improved ads by reducing the weight of assets (video, images) but maintaining quality and adding statistics to track possible future improvements"
                    ],
                    "tools": "HTML5, Vanilla JavaScript, Canvas, CSS"
                }
            ]
        }
    ]
}
